GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/applications/vdr.c
/*
   写入1分钟的vdr数据 135字节
   有可能没有写入，但要空出空间,但是长时间没有数据如何处理或空出

   改成固定长度的访问(每小时8KB)

   传递进来的是
    yymmddhhmm	  (5byte)
    60组速度和状态  (120Byte)
    单位分钟位置信息 (10Byte) 取该分钟范围内首个有效的位置信息，否则为7FFFFFFFH；
 */
void vdr_write_minute( uint8_t *vdrinfo )
{
	uint8_t		buf[128];
	uint8_t		*p = vdrinfo;

	YMDH_TIME	h_tm;
	uint32_t	addr;
	uint8_t		year	= *( p + 0 );
	uint8_t		month	= *( p + 1 );
	uint8_t		day		= *( p + 2 );
	uint8_t		hour	= *( p + 3 );
	uint8_t		min		= *( p + 4 );

	h_tm = ( year << 24 ) | ( month << 16 ) | ( day << 8 ) | ( hour );

	if( h_tm != vdr_ymdh_curr_wr ) /*又过了一个小时*/
	{
		/*todo:要不要把剩下的内容写成缺省值*/

		vdr_ymdh_curr_wr	= h_tm;
		vdr_addr_curr_wr	+= 0x1FFF;
		vdr_addr_curr_wr	&= 0xFFFF2000;
		if( vdr_addr_curr_wr >= VDR_08H_09H_END )
		{
			vdr_addr_curr_wr = VDR_08H_09H_START;
		}
		/*清除随后的8k,用作存储,这里没有判首次上电，多搽除了一次，没有关系*/
		SST25V_SectorErase_4KByte( vdr_addr_curr_wr );
		SST25V_SectorErase_4KByte( vdr_addr_curr_wr + 4096 );
		/*写入当前的小时记录字段*/
		SST25V_strWrite( p, vdr_addr_curr_wr, 5 );
	}
	/*转换到分钟的存储位置,第一个128byte是小时时间戳头，后面才开始分钟内秒速度状态*/
	addr = vdr_addr_curr_wr + min * 128 + 128;
	compress_data( vdrinfo, buf );
	SST25V_strWrite( buf, addr, 128 );
}

/*
   减少一小时
 */
static YMDH_TIME vdr_ymdh_decrease( YMDH_TIME tm )
{
	uint8_t y, m, d, h;

	y	= tm >> 24; /*2000--2255年*/
	m	= tm >> 16;
	d	= tm >> 8;
	h	= tm & 0xff;

	if( h == 0 )
	{
		h = 23;
		if( d == 1 )
		{
			switch( m )
			{
				case 1: m = 12; y--; d = 31;
					break;
				case 3: m = 2; d = ( y % 4 == 0 ) ? 29 : 28;
					break;
				case 5:
				case 7:
				case 8:
				case 10:
				case 12: m--; d = 30;
					break;
				case 2:
				case 4:
				case 6:
				case 9:
				case 11:
					m--; d = 31;
					break;
			}
		}else
		{
			d--;
		}
	}else
	{
		h--;
	}
	return ( y << 24 ) | ( m << 16 ) | ( d << 8 ) | h;
}

/*获得单位分钟行驶速度*/
static uint8_t vdr_get_08h_rec( YMDH_TIME tm, uint8_t minute, uint8_t *pout )
{
	static YMDH_TIME	curr_08h_tm = 0; /*当前查找的时刻，判断要不要重新查找*/

	int					j, k;
	YMDH_TIME			tm_find;
	uint32_t			addr;
	uint8_t				buf[128], data[135];
	uint8_t				*p, *pdump;

	addr = vdr_cmd.addr;

	if( curr_08h_tm != tm ) /*重新查找*/
	{
		/*遍历记录区，找到特定的时间，都是整小时的,占用8k空间*/
		for( addr = VDR_08H_09H_START; addr < VDR_08H_09H_END; addr += 8192 )
		{
			SST25V_BufferRead( buf, addr, 16 );
			tm_find = ( buf[0] << 24 ) | ( buf[1] << 16 ) | ( buf[2] << 8 ) | buf[3];
#ifdef STRICT_MATCH
			if( tm_find == tm )
			{
				break;                  /*这是严格判断时间包括年月日*/
			}
#else
			if( ( tm_find & 0xFF ) == ( tm & 0xFF ) )
			{
				break;;                 /*这是不严格判断,只判断小时相等*/
			}
#endif
		}

		if( addr > VDR_08H_09H_END )    /*没有找到*/
		{
			rt_kprintf( "VDR>not find 08h_09h" );
			return 0;
		}else
		{
			rt_kprintf( "VDR>find 08h_09h at 0x%08x", addr );
			vdr_cmd.addr	= addr;
			curr_08h_tm		= tm;
		}
	}

	addr	= vdr_cmd.addr + 128; /*定位到开始的单位分钟内秒速度位置*/
	p		= pout;
	SST25V_BufferRead( buf, addr + ( 128 * minute ), 128 );
	rt_kprintf( "\r\nVDR>addr=%08x\r\n", addr );
	for( j = 0; j < 128; j++ )
	{
		rt_kprintf( "%02x ", buf[j] );
	}
	decompress_data( buf, data );

	*p++	= HEX_TO_BCD( (uint8_t)( tm >> 24 ) );  /*year*/
	*p++	= HEX_TO_BCD( (uint8_t)( tm >> 16 ) );  /*month*/
	*p++	= HEX_TO_BCD( (uint8_t)( tm >> 8 ) );   /*day*/
	*p++	= HEX_TO_BCD( (uint8_t)( tm ) );        /*hour*/
	*p++	= HEX_TO_BCD( minute );                 /*miniute*/
	*p++	= HEX_TO_BCD( 0 );                      /*sec*/

	for( j = 0; j < 60; j++ )
	{
		*p++	= data[j];
		*p++	= data[60 + j];
	}

#if 1  /*调试输出*/
	pdump = pout;
	rt_kprintf( "\r\nVDR>08H\r\n" );
	for( j = 0; j < 6; j++ )
	{
		rt_kprintf( "%02x ", *pdump++ );
	}
	for( j = 0; j < 6; j++ )
	{
		rt_kprintf( "\r\n>" );
		for( k = 0; k < 20; k++ )
		{
			rt_kprintf( "%02x ", *pdump++ );
		}
	}
#endif

	return 126;
}

/*
   由于会多次调用发送数据
   1.放在定时器任务或线程中定时检查
   2.在RECODER中标记。当收到特定的中心应答的流水号后，触发再次获得数据

   首次调用
   start和end 不为空

 */

uint16_t vdr_get_08h( void )
{
	uint8_t		* p, *pdump;
	uint32_t	addr;
	int			i, j, k;
	uint8_t		buf[126];
	uint8_t		minute;
	YMDH_TIME	tm, tm_find;
	uint16_t	blocks;

/*外面要调用*/
	tm		= vdr_cmd.ymdh_curr;
	minute	= vdr_cmd.minute_curr;

	if( tm < vdr_cmd.ymdh_start ) /*判断是否大于开始时刻*/
	{
		rt_kprintf( "\r\nVDR>tm < vdr_cmd.ymdh_start" );
		return 0;
	}
	if( ( tm == vdr_cmd.ymdh_start ) && ( minute < vdr_cmd.minute_start ) )
	{
		return 0;
	}

	blocks		= vdr_cmd.blocks;
	vtr_tx_len	= 0;

	while( 1 )
	{
/*逆序输出，指定结束时间之前的最近1分钟*/
		if( minute == 0 ) /*要回到前一小时*/
		{
			minute	= 59;
			tm		= vdr_ymdh_decrease( tm );
		}else
		{
			minute--;
		}

		i = vdr_get_08h_rec( tm, minute, buf );
		if( i == 0 ) /**/
		{
			rt_kprintf( "\r\nVDR>not find rec" );
			break;
		}
		memcpy( vdr_tx_info + vtr_tx_len, buf, 126 );
		vtr_tx_len += 126;
		blocks--;
		if( blocks == 0 )
		{
			rt_kprintf( "\r\nVDR>blocks==0" );
			break;
		}
	}
	if( vtr_tx_len ) /*有数据要发送*/
	{
		rt_kprintf( "\r\nVDR>要发送08h数据(%d)bytes", vtr_tx_len );
	}
	return vtr_tx_len;
}

/*单位小时位置信息数据块*/
static uint16_t vdr_get_09h_rec( YMDH_TIME tm, uint8_t *pout )
{
	uint8_t		buf[128];
	uint8_t		data[130];

	uint8_t		*p, *pmsg;
	uint16_t	msg_count = 0;  /*当前分钟位置数据的个数*/
	uint32_t	i, j, k;
	uint32_t	addr;
	uint8_t		fFind = 0;      /*是否找到*/
	YMDH_TIME	tm_find;

	/*遍历记录区，找到特定的时间，都是整小时的,占用8k空间*/
	for( addr = VDR_08H_09H_START; addr < VDR_08H_09H_END; addr += 8192 )
	{
		SST25V_BufferRead( buf, addr, 16 );
		tm_find = ( buf[0] << 24 ) | ( buf[1] << 16 ) | ( buf[2] << 8 ) | buf[3];
#ifdef STRICT_MATCH
		if( tm_find == tm )
		{
			break;                  /*这是严格判断时间包括年月日*/
		}
#else
		if( ( tm_find & 0xFF ) == ( tm & 0xFF ) )
		{
			break;;                 /*这是不严格判断,只判断小时相等*/
		}
#endif
	}

	if( addr > VDR_08H_09H_END )    /*没有找到*/
	{
		rt_kprintf( "VDR>not find 09h" );
		return 0;
	}

	/*找到了，填充应答帧并发送*/
	p		= pout;
	*p++	= HEX_TO_BCD( (uint8_t)( tm >> 24 ) );  /*year*/
	*p++	= HEX_TO_BCD( (uint8_t)( tm >> 16 ) );  /*month*/
	*p++	= HEX_TO_BCD( (uint8_t)( tm >> 8 ) );   /*day*/
	*p++	= HEX_TO_BCD( (uint8_t)( tm ) );        /*hour*/
	*p++	= HEX_TO_BCD( 0 );                      /*miniute*/
	*p++	= HEX_TO_BCD( 0 );                      /*sec*/
	addr	+= 128;                                 /*第一个为记录头*/
	for( i = addr; i < addr + ( 60 * 128 ); i += 128 )
	{
		SST25V_BufferRead( buf, i, 128 );
		decompress_data( buf, data );
		for( j = 0; j < 60; j++ )
		{
			if( data[60 + j] & 0x01 )
			{
				break;
			}
		}
		if( j < 60 )
		{
			for( k = 0; k < 10; k++ )   /*位置信息*/
			{
				*p++ = data[120 + k];
			}
			*p++ = data[j];             /*速度*/
		}else
		{
			memcpy( p, "\x7F\xFF\xFF\xFF\x7F\xFF\xFF\xFF\x00\x00\x00", 11 );
			p += 11;
		}
	}
	rt_kprintf( "\r\nVDR_09H\r\n" );
	p = pout;
	for( i = 0; i < 6; i++ )
	{
		rt_kprintf( "%02x ", *p++ );
	}
	for( i = 0; i < 60; i++ )
	{
		rt_kprintf( "\r\n>" );
		for( j = 0; j < 11; j++ )
		{
			//rt_kprintf( "%02x ", vdr_tx_info[i * 11 + j + 6] );
			rt_kprintf( "%02x ", *p++ );
		}
	}
	return 666;
}

