GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/applications/vdr.c
/*
   传递进参数
   参见GBT19056-2013  表A.15
   返回 要发送的数据长度
   填充Recoder_Obj结构体

 */
uint32_t vdr_get_09h( void )
{
	uint8_t		buf[666];
	YMDH_TIME	tm;

	tm = vdr_cmd.ymdh_curr;

	if( vdr_cmd.blocks_remain == 0 )
	{
		rt_kprintf( "\r\nVDR>09h no block to send" );
		return 0;
	}
	if( vdr_cmd.ymdh_curr < vdr_cmd.ymdh_start )
	{
		rt_kprintf( "\r\nVDR>ymdh_start reach" );
		return 0;
	}

	/*1次只发送1个block*/

	if( vdr_get_09h_rec( tm, buf ) )
	{
		vtr_tx_len = 0;
		memcpy( vdr_tx_info, buf, 666 );
		rt_kprintf( "\r\nVDR>send 09h" );
		tm					= vdr_ymdh_decrease( tm );
		vdr_cmd.ymdh_curr	= tm;
		vdr_cmd.blocks_remain--;
		return 666;
	}
	return 0;
}

/*
   事故疑点 Accident Point
 */

static uint8_t vdr_get_10h( void )
{
	uint8_t		* p, *pdump;
	uint32_t	addr;
	int			i, j, k;
	uint8_t		buf[128];
	uint8_t		minute;
	YMDH_TIME	tm, tm_find;
	uint32_t	blocks;

	blocks = vdr_cmd.blocks_remain;
	if( blocks == 0 )
	{
		return 0;
	}

	/*遍历记录区，找到特定的时间，都是整小时的,占用256空间*/
	p	= vdr_tx_info;
	i	= 0;
	for( addr = VDR_10H_START; addr <= VDR_10H_END; addr += 256 )
	{
		SST25V_BufferRead( buf, addr, 234 );

		while( blocks )
		{
		}
	}
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static uint8_t vdr_get_11h( void )
{
	uint8_t		* p, *pdump;
	uint32_t	addr;
	int			i, j, k;
	uint8_t		buf[128];
	uint8_t		data[130];
	uint8_t		minute;
	YMDH_TIME	tm, tm_find;
	uint32_t	blocks;

	tm		= vdr_cmd.ymdh_curr;
	minute	= vdr_cmd.minute_end;
	blocks	= vdr_cmd.blocks;

	/*遍历记录区，找到特定的时间，都是整小时的,占用256空间*/
	for( addr = VDR_11H_START; addr < VDR_11H_END; addr += 64 )
	{
		SST25V_BufferRead( buf, addr, 16 );
		tm_find = ( buf[0] << 24 ) | ( buf[1] << 16 ) | ( buf[2] << 8 ) | buf[3];
#ifdef STRICT_MATCH
		if( tm == tm_find )
		{
			return addr;        /*这是严格判断时间包括年月日*/
		}
#else
		if( ( tm & 0xFF ) == ( tm_find & 0xFF ) )
		{
			return addr;        /*这是不严格判断,只判断小时相等*/
		}
#endif
	}

	if( addr > VDR_11H_END )    /*没有找到*/
	{
		rt_kprintf( "VDR>not find 11h" );
		return 0;
	}
}

/*
   外部供电记录
   都存在4k的记录里，1次读出
 */
static uint8_t vdr_get_12h( void )
{
	uint8_t		* p, *pbuf;
	uint32_t	addr;
	int			i, j, k;
	uint8_t		minute;
	YMDH_TIME	tm, tm_find;
	uint32_t	blocks;

	tm		= vdr_cmd.ymdh_curr;
	minute	= vdr_cmd.minute_end;
	blocks	= vdr_cmd.blocks;

	pbuf = rt_malloc( 4096 );
	if( pbuf == RT_NULL )
	{
		rt_kprintf( "\r\nVDR>%s malloc error", __func__ );
		return 0;
	}

	SST25V_BufferRead( pbuf, VDR_12H_START, 4096 );

	for( i = 0; i < 100; i++ )  /*100条 32byte*/
	{
		tm_find = ( *( pbuf + i * 32 ) << 24 ) | ( *( pbuf + i * 32 + 1 ) << 16 ) | ( *( pbuf + i * 32 + 2 ) << 8 ) | *( pbuf + i * 32 + 3 );
#ifdef STRICT_MATCH
		if( tm == tm_find )
		{
			break;;             /*这是严格判断时间包括年月日*/
		}
#else
		if( ( tm & 0xFF ) == ( tm_find & 0xFF ) )
		{
			break;              /*这是不严格判断,只判断小时相等*/
		}
#endif
	}

	if( addr > VDR_12H_END )    /*没有找到*/
	{
		rt_kprintf( "VDR>not find 12h" );
		return 0;
	}

	rt_free( pbuf );
}

/*都存在4k的记录里，1次读出*/

static uint8_t vdr_get_13h( void )
{
	uint8_t		* p, *pbuf;
	uint32_t	addr;
	int			i, j, k;
	uint8_t		minute;
	YMDH_TIME	tm, tm_find;
	uint32_t	blocks;

	tm		= vdr_cmd.ymdh_curr;
	minute	= vdr_cmd.minute_end;
	blocks	= vdr_cmd.blocks_remain;

	pbuf = rt_malloc( 4096 );
	if( pbuf == RT_NULL )
	{
		rt_kprintf( "\r\nVDR>%s malloc error", __func__ );
		return 0;
	}

	SST25V_BufferRead( pbuf, VDR_12H_START, 4096 );

	for( i = 0; i < 100; i++ ) /*100条 32byte*/
	{
		tm_find = ( *( pbuf + i * 32 ) << 24 ) | ( *( pbuf + i * 32 + 1 ) << 16 ) | ( *( pbuf + i * 32 + 2 ) << 8 ) | *( pbuf + i * 32 + 3 );
	}

	rt_free( pbuf );
}

/*都存在4k的记录里，1次读出*/

static uint8_t vdr_get_14h( void )
{
	uint8_t		*pbuf;
	uint32_t	addr;
	int			i, j, k;
	uint8_t		minute;
	YMDH_TIME	tm, tm_find;
	uint32_t	blocks;

	tm		= vdr_cmd.ymdh_curr;
	minute	= vdr_cmd.minute_end;
	blocks	= vdr_cmd.blocks;

	pbuf = rt_malloc( 4096 );
	if( pbuf == RT_NULL )
	{
		rt_kprintf( "\r\nVDR>%s malloc error", __func__ );
		return 0;
	}

	SST25V_BufferRead( pbuf, VDR_12H_START, 4096 );

	for( i = 0; i < 100; i++ )  /*100条 32byte*/
	{
		tm_find = ( *( pbuf + i * 32 ) << 24 ) | ( *( pbuf + i * 32 + 1 ) << 16 ) | ( *( pbuf + i * 32 + 2 ) << 8 ) | *( pbuf + i * 32 + 3 );
#ifdef STRICT_MATCH
		if( tm == tm_find )
		{
			break;;             /*这是严格判断时间包括年月日*/
		}
#else
		if( ( tm & 0xFF ) == ( tm_find & 0xFF ) )
		{
			break;              /*这是不严格判断,只判断小时相等*/
		}
#endif
	}

	if( addr > VDR_12H_END )    /*没有找到*/
	{
		rt_kprintf( "VDR>not find 12h" );
		return 0;
	}

	rt_free( pbuf );
}

/*都存在4k的记录里，1次读出*/

static uint8_t vdr_get_15h( void )
{
	uint8_t		* p, *pbuf;
	uint32_t	addr;
	int			i, j, k;
	uint8_t		minute;
	YMDH_TIME	tm, tm_find;
	uint32_t	blocks;

	tm		= vdr_cmd.ymdh_curr;
	minute	= vdr_cmd.minute_end;
	blocks	= vdr_cmd.blocks;

	pbuf = rt_malloc( 4096 );
	if( pbuf == RT_NULL )
	{
		rt_kprintf( "\r\nVDR>%s malloc error", __func__ );
		return 0;
	}

	SST25V_BufferRead( pbuf, VDR_12H_START, 4096 );

	rt_free( pbuf );
}

/*
   接收vdr命令,天津平台看到有粘包的情况
   通过 Recoder_obj 返回
 */
uint8_t vdr_rx1( uint8_t * info, uint16_t count )
{
	uint8_t		*p = info;
	uint8_t		cmd;
	uint16_t	len;
	uint8_t		dummy;
	uint16_t	blocks;
	uint8_t		i, j, k;

	rt_kprintf( "\r\n vdr_rx %d bytes\r\n", count );
	for( i = 0; i < count; i++ )
	{
		rt_kprintf( "%02x ", *p++ );
	}

	if( *p++ != 0xAA )
	{
		return 1;
	}
	if( *p++ != 0x75 )
	{
		return 2;
	}
	cmd		= *p++;
	len		= ( *p++ << 8 );
	len		|= *p++;
	dummy	= *p++;

	vdr_cmd.ymdh_start = 0;
	for( k = 0; k < 4; k++ )
	{
		i					= *p++;
		j					= ( i >> 4 ) * 10 + ( i & 0x0f );
		vdr_cmd.ymdh_start	<<= 8;
	}
	p					+= 2;
	vdr_cmd.ymdh_end	= 0;
	for( k = 0; k < 4; k++ )
	{
		i					= *p++;
		j					= ( i >> 4 ) * 10 + ( i & 0x0f );
		vdr_cmd.ymdh_end	<<= 8;
	}
	p				+= 2;
	blocks			= ( *p++ << 8 );
	blocks			|= *p;
	vdr_cmd.blocks	= blocks;

	rt_kprintf( "\r\nVDR> rx start:%08x end:%08x block:%d", vdr_cmd.ymdh_start, vdr_cmd.ymdh_end, vdr_cmd.blocks );

