GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/applications/vdr.c
/*
   事故疑点
   234Byte
   共100个
 */
uint8_t get_10h( uint8_t *pout )
{
	static uint32_t addr_10 = VDR_10H_START;
	uint8_t			buf[240];
	uint8_t			*p;
	uint32_t		i;
#ifdef DBG_VDR
	pout = testbuf;
#endif
	p = pout;

	if( addr_10 > VDR_10H_END )
	{
		addr_10 = VDR_10H_START;
	}
	WatchDog_Feed( );
	SST25V_BufferRead( buf, addr_10, 234 );
	memcpy( p, buf, 234 );
	addr_10 += 256;

#ifdef  DBG_VDR
	rt_kprintf( "\r\nVDR>10H" );
	p = pout;
	for( i = 0; i < 234; i++ )
	{
		if( i % 8 == 0 )
		{
			rt_kprintf( "\r\n" );
		}
		rt_kprintf( "%02x ", *p++ );
	}

#endif
	return 234;
}

FINSH_FUNCTION_EXPORT( get_10h, get_10 );


/*超时驾驶记录
   50Bytes   100条
 */

uint8_t get_11h( uint8_t *pout )
{
	static uint32_t addr_11 = VDR_11H_START;
	uint8_t			buf[64];
	uint8_t			*p = RT_NULL;
	uint32_t		i, j;

#ifdef DBG_VDR
	pout = testbuf;
#endif
	p = pout;

	if( addr_11 > VDR_11H_END )
	{
		addr_11 = VDR_11H_START;
	}
	WatchDog_Feed( );
	for( j = 0; j < 1; j++ )
	{
		SST25V_BufferRead( buf, addr_11, 50 );
		for( i = 0; i < 50; i++ ) /*平台不认转义。SHIT....*/
		{
			if( buf[i] == 0x7d )
			{
				buf[i] = 0x7C;
			}
			if( buf[i] == 0x7E )
			{
				buf[i] = 0x7F;
			}
		}
		memcpy( p + j * 50, buf, 50 );
		addr_11 += 64;
	}

#ifdef  DBG_VDR
	rt_kprintf( "\r\nVDR>11H @0x%08x", addr_11 );
	p = pout;
	for( i = 0; i < 500; i++ )
	{
		//WatchDog_Feed( );
		if( i % 8 == 0 )
		{
			rt_kprintf( "\r\n" );
		}
		rt_kprintf( "%02x ", *p++ );
	}
#endif
	return 50;
}

FINSH_FUNCTION_EXPORT( get_11h, get_11 );


/*驾驶员身份登录
   25Bytes   200条
 */

uint8_t get_12h( uint8_t *pout )
{
	static uint32_t addr_12 = VDR_12H_START;
	uint8_t			buf[26];
	uint8_t			*p;
	uint32_t		i, j;
#ifdef DBG_VDR
	pout = testbuf;
#endif
	p = pout;

	if( addr_12 > VDR_12H_END )
	{
		addr_12 = VDR_12H_START;
	}

	for( j = 0; j < 20; j++ )
	{
		WatchDog_Feed( );
		SST25V_BufferRead( buf, addr_12, 25 );
		memcpy( p + j * 25, buf, 25 );
		addr_12 += 32;
	}
#ifdef DBG_VDR
	rt_kprintf( "\r\nVDR>12H @0x%08x", addr_12 );
	p = pout;
	for( i = 0; i < 500; i++ )
	{
		if( i % 8 == 0 )
		{
			rt_kprintf( "\r\n" );
		}
		rt_kprintf( "%02x ", *p++ );
	}
#endif
	return 500;
}

FINSH_FUNCTION_EXPORT( get_12h, get_12 );


/*外部供电记录
   7字节 100条**/
uint8_t get_13h( uint8_t *pout )
{
	static uint32_t addr_13 = VDR_13H_START;
	uint8_t			buf[8];
	uint8_t			*p;
	uint32_t		i, j;
#ifdef DBG_VDR
	pout = testbuf;
#endif
	p = pout;

	if( addr_13 > VDR_13H_END )
	{
		addr_13 = VDR_13H_START;
	}
	for( j = 0; j < 100; j++ )
	{
		WatchDog_Feed( );
		SST25V_BufferRead( buf, addr_13, 8 );
		memcpy( p + j * 7, buf, 7 );

		addr_13 += 8;
	}
#if 1
	rt_kprintf( "\r\nVDR>13H @0x%08x\r\n", addr_13 );
	p = pout;
	for( i = 0; i < 700; i++ )
	{
		if( i % 7 == 0 )
		{
			rt_kprintf( "\r\n" );
		}
		rt_kprintf( "%02x ", *p++ );
	}
#endif

	return 700;
}

FINSH_FUNCTION_EXPORT( get_13h, get_13 );


/*记录仪参数
   7字节 100条*/
uint8_t get_14h( uint8_t *pout )
{
	static uint32_t addr_14 = VDR_14H_START;
	uint8_t			buf[8];
	uint8_t			*p;
	uint32_t		i, j;
#ifdef DBG_VDR
	pout = testbuf;
#endif
	p = pout;
	if( addr_14 > VDR_14H_END )
	{
		addr_14 = VDR_14H_START;
	}
	for( j = 0; j < 100; j++ )
	{
		WatchDog_Feed( );
		SST25V_BufferRead( buf, addr_14, 8 );
		memcpy( p + j * 7, buf, 7 );
		addr_14 += 8;
	}

#ifdef  DBG_VDR
	rt_kprintf( "\r\nVDR>14H @0x%08x\r\n", addr_14 );
	p = pout;
	for( i = 0; i < 700; i++ )
	{
		if( i % 7 == 0 )
		{
			rt_kprintf( "\r\n" );
		}
		rt_kprintf( "%02x ", *p++ );
	}
#endif
	return 700;
}

FINSH_FUNCTION_EXPORT( get_14h, get_14 );


/*
   速度状态日志
   133Byte
   共10个
 */
uint8_t get_15h( uint8_t *pout )
{
	static uint32_t addr_15 = VDR_15H_START;
	uint8_t			buf[140];
	uint8_t			*p;
	uint32_t		i, j;
#ifdef DBG_VDR
	pout = testbuf;
#endif
	p = pout;

	if( addr_15 > VDR_15H_END )
	{
		addr_15 = VDR_15H_START;
	}
	WatchDog_Feed( );
	for( i = 0; i < 1; i++ )
	{
		SST25V_BufferRead( buf, addr_15, 134 );
		memcpy( p + i * 133, buf, 133 );

#ifdef  DBG_VDR
		rt_kprintf( "\r\nVDR>15H @0x%08x", addr_15 );
		p = pout;
		for( i = 0; i < 133; i++ )
		{
			if( i % 8 == 0 )
			{
				rt_kprintf( "\r\n" );
			}
			rt_kprintf( "%02x ", *p++ );
		}
#endif
		addr_15 += 256;
	}
	return 133;
//	return 133 * 5;
}

FINSH_FUNCTION_EXPORT( get_15h, get_15 );


/*
   获得vdr数据
   00-07 单包数据
   08-15 多包数据
 */
uint8_t get_vdr( VDRCMD* vdrcmd, uint8_t *pout, uint16_t *len )
{
	uint8_t cmd;
	cmd = vdrcmd->cmd;
	switch( cmd )
	{
		case 0:
			break;
		case 1:
			break;
		case 2:
			break;
		case 3:
			break;
		case 4:
			break;
		case 5:
			break;
		case 6:
			break;
		case 7:
			break;
		case 8:
			break;
		case 9:
			break;
		case 0x10:
			break;
		case 0x11:
			break;
		case 0x12:
			break;
		case 0x13:
			break;
		case 0x14:
			break;
		case 0x15:
			break;
	}
}

#endif

#define BYTESWAP2( val )    \
    ( ( ( val & 0xff ) << 8 ) |   \
      ( ( val & 0xff00 ) >> 8 ) )

#define BYTESWAP4( val )    \
    ( ( ( val & 0xff ) << 24 ) |   \
      ( ( val & 0xff00 ) << 8 ) |  \
      ( ( val & 0xff0000 ) >> 8 ) |  \
      ( ( val & 0xff000000 ) >> 24 ) )

#define MYDATETIME( year, month, day, hour, minute, sec )	( ( year << 26 ) | ( month << 22 ) | ( day << 17 ) | ( hour << 12 ) | ( minute << 6 ) | sec )
#define YEAR( datetime )									( ( datetime >> 26 ) & 0x3F )
#define MONTH( datetime )									( ( datetime >> 22 ) & 0xF )
#define DAY( datetime )										( ( datetime >> 17 ) & 0x1F )
#define HOUR( datetime )									( ( datetime >> 12 ) & 0x1F )
#define MINUTE( datetime )									( ( datetime >> 6 ) & 0x3F )
#define SEC( datetime )										( datetime & 0x3F )


/*
   通过存储时，建立一定的对应关系，达到快速索引的目的
 */


/*
   48小时，每分钟平均速度和状态
   每个记录块 126字节,
   开始时间（6Byte）+单位分钟内每秒的速度和状态信息（（速度1Byte+状态1Byte）*60）
 */

static uint8_t	rec_08h_head[128];  /*文件头*/
static uint8_t	rec_08h_data[128];  /*数据*/

/*获取08数据*/
static uint8_t get_08h( )
{
}


static uint32_t mytime_08_max	= 0, mytime_08_min = 0xFFFFFFFF;
static uint16_t rec_08_max		= 0, rec_08_min;


static uint32_t mytime_09_max	= 0, mytime_09_min = 0xFFFFFFFF;
static uint16_t rec_09_max		= 0, rec_09_min;



