GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/applications/vdr.c
/*
   获取08存储的状态 48小时 单位分钟内每秒的速度状态2byte  
   48*60=2880个(128byte) 占用 90sector
   多分配一个sector(32分钟的数据)，这样在循环写入时，可以直写，而不用回写。保证数据足够
   
 */

static void vdr_init_08h( uint8_t *p )
{
	uint8_t		sect, rec, offset;
	uint8_t		*prec;
	uint8_t		find;
	uint32_t	mytime_curr;

	for( sect = 0; sect < 90; sect++ )
	{
		sst25_read( VDR_08H_START + sect * 4096, p, 4096 );
		for( rec = 0; rec < 64; rec++ )
		{
			prec = p + rec * 128;
			if( ( prec[0] == '0' ) && ( prec[1] == '8' ) )                                          /*是有效的数据包*/
			{
				mytime_curr = MYDATETIME( prec[2], prec[3], prec[4], prec[5], prec[6], prec[7] );   /*整分钟时刻*/
				if( mytime_curr > mytime_08_max )
				{
					mytime_08_max	= mytime_curr;
					rec_08_max		= sect * 128 + rec;
				}
				if( mytime_curr < mytime_08_min )
				{
					mytime_08_min	= mytime_curr;
					rec_08_min		= sect * 128 + rec;
				}
			}
		}
	}
	rt_kprintf( "\r\n%d>08_max(rec_08_max):%d-%d-%d %d:%d:%d", rt_tick_get( ),rec_08_max,YEAR(mytime_08_max),MONTH(mytime_08_max),DAY(mytime_08_max),HOUR(mytime_08_max),MINUTE(mytime_08_max),SEC(mytime_08_max));
	rt_kprintf( "\r\n%d>08_min(rec_08_min):%d-%d-%d %d:%d:%d\r\n", rt_tick_get( ),rec_08_min,YEAR(mytime_08_min),MONTH(mytime_08_min),DAY(mytime_08_min),HOUR(mytime_08_min),MINUTE(mytime_08_min),SEC(mytime_08_min));
}

/*
   获取09存储的状态 360小时每分钟速度状态记录
   360*666字节

   如果按分钟存储 6+11=17

   48*60=2880个(128byte) 占用 90sector
 */

static void vdr_init_09h( uint8_t *p )
{
	uint8_t		sect, rec, offset;
	uint8_t		*prec;
	uint8_t		find;
	uint32_t	mytime_curr;

	for( sect = 0; sect < 90; sect++ )
	{
		sst25_read( VDR_09H_START + sect * 4096, p, 4096 );
		for( rec = 0; rec < 64; rec++ )
		{
			prec = p + rec * 128;
			if( ( prec[0] == '0' ) && ( prec[1] == '8' ) )                                          /*是有效的数据包*/
			{
				mytime_curr = MYDATETIME( prec[2], prec[3], prec[4], prec[5], prec[6], prec[7] );   /*整分钟时刻*/
				if( mytime_curr > mytime_08_max )
				{
					mytime_08_max	= mytime_curr;
					rec_08_max		= sect * 128 + rec;
				}
				if( mytime_curr < mytime_08_min )
				{
					mytime_08_min	= mytime_curr;
					rec_08_min		= sect * 128 + rec;
				}
			}
		}
	}
	rt_kprintf( "\r\n%d>08_max(rec_08_max):%d-%d-%d %d:%d:%d", rt_tick_get( ),rec_08_max,YEAR(mytime_08_max),MONTH(mytime_08_max),DAY(mytime_08_max),HOUR(mytime_08_max),MINUTE(mytime_08_max),SEC(mytime_08_max));
	rt_kprintf( "\r\n%d>08_min(rec_08_min):%d-%d-%d %d:%d:%d\r\n", rt_tick_get( ),rec_08_min,YEAR(mytime_08_min),MONTH(mytime_08_min),DAY(mytime_08_min),HOUR(mytime_08_min),MINUTE(mytime_08_min),SEC(mytime_08_min));
}





/*
   初始化记录区数据
   因为是属于固定时间段存储的
   需要记录开始时刻的sector位置(相对的sector偏移)
 */
rt_err_t vdr_init( void )
{
	uint8_t* pbuf;
	pbuf = rt_malloc( 4096 );
	if( pbuf == RT_NULL )
	{
		return -RT_ENOMEM;
	}
	vdr_init_08h( pbuf );
	vdr_init_09h( pbuf );

	rt_free( pbuf );
	pbuf = RT_NULL;
}

/*
   收到gps数据的处理
   存储位置信息，
   速度判断，校准
 */

rt_err_t vdr_rx( void )
{
	uint32_t	alarm, status, lati, longi;
	uint16_t	speed, alt;
	alarm	= BYTESWAP4( gps_baseinfo.alarm );
	status	= BYTESWAP4( gps_baseinfo.status );
	lati	= BYTESWAP4( gps_baseinfo.latitude);
	longi	= BYTESWAP4( gps_baseinfo.longitude);
	speed	= BYTESWAP2( gps_baseinfo.speed_10x );
	alt		= BYTESWAP4( gps_baseinfo.altitude );
}

/************************************** The End Of File **************************************/
